app/controllers/alarms_controller.rb

  def index
    @alarms = Alarm.all
---
SELECT "alarms".* FROM "alarms"