app/controllers/members_controller.rb

SELECT  "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @department = Department.find_by_id(params[:department_id])

SELECT  "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    department = Department.find_by_id(params[:department_id])