app/views/members/_form.html.erb

    <%= f.label :state_id %>
    <%= f.select :state_id, options_from_collection_for_select(State.all, :id, :abbreviation) %>
---
SELECT "states".* FROM "states"

    <%= f.label :bloodtype_id %>
    <%= f.select :bloodtype_id, options_from_collection_for_select(BloodType.all, :id, :type) %>
---
SELECT "blood_types".* FROM "blood_types"